zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
/**************************************************************************//**
 * @file     pmc_reg.h
 * @version  V1.00
 * @brief    PMC register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __PMC_REG_H__
#define __PMC_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/** @addtogroup REGISTER Control Register
  @{
*/

/**
    @addtogroup PMC Power Manager (PMC)
    Memory Mapped Structure for PMC Controller
    @{
*/

typedef struct
{


    /**
     * @var PMC_T::PWRCTL
     * Offset: 0x00  System Power-down Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |D0PGEN    |Power Domain 0 Power Gating Enable Bit (Write Protect)
     * |        |          |This bit control power domain 0 (Performance Domain) power gating function when system enter Power-down mode(CPU execute WFI/WFE instruction and SLEEPDEEP(SCR[2]) is 1).
     * |        |          |0 = Power domain 0 keep supply.
     * |        |          |1 = Power domain 0 stop supply.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[1]     |D1PGEN    |Power Domain 1 Power Gating Enable Bit (Write Protect)
     * |        |          |This bit control power domain 1 (Base Domain) power gating function when system enter Power-down mode(CPU execute WFI/WFE instruction and SLEEPDEEP(SCR[2]) is 1).
     * |        |          |0 = Power domain 1 keep supply.
     * |        |          |1 = Power domain 1 stop supply.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: If D0PGEN(PMC_PWRCTL[0]) is 0, The power domain 1 always keep supply, even if D1PGEN is 1.
     * |        |          |Note 4: This bit is not retained when D4 power is turned off.
     * |[2]     |D2PGEN    |Power Domain 2 Power Gating Enable Bit (Write Protect)
     * |        |          |This bit control power domain 2 (Low Power Domain) power gating function when system enter Power-down mode(CPU execute WFI/WFE instruction and SLEEPDEEP(SCR[2]) is 1).
     * |        |          |0 = Power domain 2 keep supply.
     * |        |          |1 = Power domain 2 stop supply.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: If D1PGEN(PMC_PWRCTL[1]) is 0, The power domain 2 always keep supply, even if D2PGEN is 1.
     * |        |          |Note 4: This bit is not retained when D4 power is turned off.
     * |[3]     |D3PGEN    |Power Domain 3 Power Gating Enable Bit (Write Protect)
     * |        |          |This bit control power domain 3 (Standby Power Domain) power gating function when system enter Power-down mode(CPU execute WFI/WFE instruction and SLEEPDEEP(SCR[2]) is 1).
     * |        |          |0 = Power domain 3 keep supply.
     * |        |          |1 = Power domain 3 stop supply.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: If D2PGEN(PMC_PWRCTL[2]) is 0, The power domain 3 always keep supply, even if D3PGEN is 1.
     * |        |          |Note 4: This bit is not retained when D4 power is turned off.
     * |[8]     |AOCKPDEN  |Auto Operation Mode Clock Power-down Enable (Write Protect)
     * |        |          |When this bit is set to 1, Auto Operation Mode clock Power-down mode is enabled and MIRC and HIRC keeps active till the chip enter Power-down mode.
     * |        |          |If chip in Power-down mode, HXT, HIRC48M, APLL0, APLL1 and system clock will be disabled and ignored the clock source selection
     * |        |          |The clocks of peripheral are not controlled by Power-down mode, if the peripheral clock source is from LXT, LIRC, MIRC or HIRC.
     * |        |          |0 = MIRC and HIRC enable in Power-down mode.
     * |        |          |1 = MIRC and HIRC disable in Power-down mode under normal circumstances, but MIRC and HIRC will be enable via a trigger from auto operation mode.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: This bit is not retained when D2 power is turned off.
     * |[10]    |VDROPEN   |Voltage Regulator Output Drop Enable Bit (Write Protect)
     * |        |          |When this bit is set to 1, voltage regulator output drop to 0.7v in Power-down mode.
     * |        |          |0 = Regulator voltage auto drop function Disabled.
     * |        |          |1 = Regulator voltage auto drop function Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * |[11]    |FWEN      |Fast Wake-up Enable Bit (Write Protect)
     * |        |          |When this bit is set to 1, wake-up will be speed up, but power consumption is increase about 30uA in Power-down mode.
     * |        |          |0 = Regulator voltage auto drop function Disabled.
     * |        |          |1 = Regulator voltage auto drop function Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[12]    |PRSTDBEN  |Pin Reset De-Bounce Enable Bit (Write Protect)
     * |        |          |When this bit is set to 1, pin reset clock base de-bounce circuit is enable in Power-down mode.
     * |        |          |0 = Pin reset de-bounce circuit Disable, and de-bounce time about 300ns.
     * |        |          |1 = Pin reset de-bounce circuit Enable, and de-bounce time about 32us.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: This bit is not retained when D2 power is turned off.
     * |        |          |Note 3: If D2PGEN(PMC_PWRCTL[2]) is 1, The pin reset de-bounce circuit always keep disable, even if PRSTDBEN is 1.
     * |        |          |Note 4: If VDROPEN(PMC_PWRCTL[10]) is 1, The pin reset de-bounce circuit always keep disable, even if PRSTDBEN is 1.
     * |[31]    |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If PMC_PWRCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.
     * |        |          |0 = PMC_PWRCTL register is ready for write operation.
     * |        |          |1 = PMC_PWRCTL register is busy on the last write operation. Other write operations are ignored.
     * @var PMC_T::INTEN
     * Offset: 0x04  PMC Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PDWKIEN   |Power-down Mode Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = Power-down mode wake-up interrupt Disabled.
     * |        |          |1 = Power-down mode wake-up interrupt Enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both PDWKIF(PMC_INTSTS[0] and PDWKIEN(PMC_INTEN[0]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[1]     |STMRWKIEN |Standby Timer Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = High Voltage Timer wake-up interrupt disable.
     * |        |          |1 = High Voltage Timer wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both STMRWKIF(PMC_INTSTS[1] and STMRWKIEN(PMC_INTEN[1]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[8]     |PIN0WKIEN |Pin 0 Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = Pin 0 wake-up interrupt disabled.
     * |        |          |1 = Pin 0 wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN0WKIF(PMC_INTSTS[8] and PIN0WKIEN(PMC_INTEN[8]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[9]     |PIN1WKIEN |Pin 1 Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = Pin 1 wake-up interrupt disabled.
     * |        |          |1 = Pin 1 wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN1WKIF(PMC_INTSTS[9] and PIN1WKIEN(PMC_INTEN[9]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[10]    |PIN2WKIEN |Pin 2 Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = Pin 2 wake-up interrupt disabled.
     * |        |          |1 = Pin 2 wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN2WKIF(PMC_INTSTS[10] and PIN2WKIEN(PMC_INTEN[10]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[11]    |PIN3WKIEN |Pin 3 Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = Pin 3 wake-up interrupt disabled.
     * |        |          |1 = Pin 3 wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN3WKIF(PMC_INTSTS[11] and PIN3WKIEN(PMC_INTEN[11]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[12]    |PIN4WKIEN |Pin 4 Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = Pin 4 wake-up interrupt disabled.
     * |        |          |1 = Pin 4 wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN4WKIF(PMC_INTSTS[12] and PIN4WKIEN(PMC_INTEN[12]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[13]    |PIN5WKIEN |Pin 5 Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = Pin 5 wake-up interrupt disabled.
     * |        |          |1 = Pin 5 wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN4WKIF(PMC_INTSTS[13] and PIN4WKIEN(PMC_INTEN[13]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[16]    |GPATGWKIEN|GPA Trigger Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = GPA triggrer wake-up interrupt disabled.
     * |        |          |1 = GPA triggrer wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both GPATGWKIF(PMC_INTSTS[16] and GPATGWKIEN(PMC_INTEN[16]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * |[17]    |GPBTGWKIEN|GPB Trigger Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = GPB triggrer wake-up interrupt disabled.
     * |        |          |1 = GPB triggrer wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both GPBTGWKIF(PMC_INTSTS[17] and GPBTGWKIEN(PMC_INTEN[17]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * |[18]    |GPCTGWKIEN|GPC Trigger Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = GPC triggrer wake-up interrupt disabled.
     * |        |          |1 = GPC triggrer wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both GPCTGWKIF(PMC_INTSTS[18] and GPCTGWKIEN(PMC_INTEN[18]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * |[19]    |GPDTGWKIEN|GPD Trigger Wake-up Interrupt Enable Bit (Write Protect)
     * |        |          |0 = GPD triggrer wake-up interrupt disabled.
     * |        |          |1 = GPD triggrer wake-up interrupt enabled.
     * |        |          |Note 1: The PMC interrupt will occur when both GPDTGWKIF(PMC_INTSTS[19] and GPDTGWKIEN(PMC_INTEN[19]) are 1.
     * |        |          |Note 2: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * @var PMC_T::INTSTS
     * Offset: 0x08  PMC Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PDWKIF    |Power-down Mode Wake-up Interrupt Status
     * |        |          |Set by u201CPower-down wake-up eventu201D, it indicates that resume from Power-down mode.
     * |        |          |The flag is set if any wake-up source occurred. Refer Power Modes and Wake-up Sources chapter.
     * |        |          |Note 1: The PMC interrupt will occur when both PDWKIF(PMC_INTSTS[0] and PDWKIEN(PMC_INTEN[0]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[1]     |STMRWKIF  |Standby Timer Wake-up Interrupt Status
     * |        |          |The flag is set if stadnby timer wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both STMRWKIF(PMC_INTSTS[1] and STMRWKIEN(PMC_INTEN[1]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[8]     |PIN0WKIF  |Pin 0 Wake-up Interrupt Status
     * |        |          |The flag is set if Pin 0 wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN0WKIF(PMC_INTSTS[8] and PIN0WKIEN(PMC_INTEN[8]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[9]     |PIN1WKIF  |Pin 1 Wake-up Interrupt Status
     * |        |          |The flag is set if Pin 1 wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN1WKIF(PMC_INTSTS[9] and PIN1WKIEN(PMC_INTEN[9]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[10]    |PIN2WKIF  |Pin 2 Wake-up Interrupt Status
     * |        |          |The flag is set if Pin 2 wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN2WKIF(PMC_INTSTS[10] and PIN2WKIEN(PMC_INTEN[10]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[11]    |PIN3WKIF  |Pin 3 Wake-up Interrupt Status
     * |        |          |The flag is set if Pin 3 wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN3WKIF(PMC_INTSTS[11] and PIN3WKIEN(PMC_INTEN[11]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[12]    |PIN4WKIF  |Pin 4 Wake-up Interrupt Status
     * |        |          |The flag is set if Pin 4 wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN4WKIF(PMC_INTSTS[12] and PIN4WKIEN(PMC_INTEN[12]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[13]    |PIN5WKIF  |Pin 5 Wake-up Interrupt Status
     * |        |          |The flag is set if Pin 5 wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both PIN4WKIF(PMC_INTSTS[13] and PIN4WKIEN(PMC_INTEN[13]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[16]    |GPATGWKIF |GPA Trigger Wake-up Interrupt Status
     * |        |          |The flag is set if GPA trigger wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both GPATGWKIF(PMC_INTSTS[16] and GPATGWKIEN(PMC_INTEN[16]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[17]    |GPBTGWKIF |GPB Trigger Wake-up Interrupt Status
     * |        |          |The flag is set if GPB trigger wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both GPBTGWKIF(PMC_INTSTS[17] and GPBTGWKIEN(PMC_INTEN[17]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[18]    |GPCTGWKIF |GPC Trigger Wake-up Interrupt Status
     * |        |          |The flag is set if GPC trigger wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both GPCTGWKIF(PMC_INTSTS[18] and GPCTGWKIEN(PMC_INTEN[18]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[19]    |GPDTGWKIF |GPC Trigger Wake-up Interrupt Status
     * |        |          |The flag is set if GPD trigger wake-up event occurred in Power-down mode.
     * |        |          |Note 1: The PMC interrupt will occur when both GPDTGWKIF(PMC_INTSTS[19] and GPDTGWKIEN(PMC_INTEN[19]) are 1.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * |[31]    |CLRWK     |Clear Wake-up Flag
     * |        |          |Clearing the Wake-up flag is not timely
     * |        |          |Flags in PMC_INTSTS will not be immediately cleared in the next cycle when CLRWK written to 1.
     * |        |          |0 = No clear.
     * |        |          |1 = Clear all wake-up flags.
     * |        |          |Note 1: This bit is auto cleared by hardware.
     * @var PMC_T::PLCTL
     * Offset: 0x10  Power Level Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |PLSEL     |Power Level Select (Write Protect)
     * |        |          |00 = Set to Power level 0 (PL0).
     * |        |          |01 = Set to Power level 1 (PL1). (default)
     * |        |          |10 = Set to Power level 2 (PL2).
     * |        |          |11 = Reserved.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[31]    |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If PMC_PLCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.
     * |        |          |0 = PMC_PLCTL register is ready for write operation.
     * |        |          |1 = PMC_PLCTL register is busy on the last write operation. Other write operations are ignored.
     * @var PMC_T::PLSTS
     * Offset: 0x14  Power Level Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |PLSTATUS  |Power Level Status (Read Only)
     * |        |          |This bit field reflect the current power level.
     * |        |          |00 = Power level is PL0.
     * |        |          |01 = Power level is PL1.
     * |        |          |10 = Power level is PL2.
     * |[31]    |PLCBUSY   |Power Level Change Busy Bit (Read Only)
     * |        |          |This bit is set by hardware when power level is changing
     * |        |          |After power level change is completed, this bit will be cleared automatically by hardware.
     * |        |          |0 = Power level change is completed.
     * |        |          |1 = Power level change is ongoing.
     * @var PMC_T::IOSHCTL
     * Offset: 0x20  GPIO Status Hold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IOHR      |GPIO Hold Release
     * |        |          |When system enter Power-down mode with D1PGEN = 1 and D3PGEN = 0, all I/O status are hold to keep normal operating status
     * |        |          |After chip is woken from Power-down mode, the I/O are still keep hold status until user set this bit to release I/O hold status.
     * |        |          |Note 1: This bit is auto cleared by hardware.
     * |        |          |Note 2: This bit is not retained when D0 power is turned off.
     * @var PMC_T::BATLDCTL
     * Offset: 0x28  Battery Loss Detector Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BATLDEN   |Battery Loss Detector Enable Bit (Write Protect)
     * |        |          |0 = Battery Loss Detector Disabled.
     * |        |          |1 = Battery Loss Detector Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: This bit is not retained when D3 power is turned off.
     * @var PMC_T::IOTGDBCTL
     * Offset: 0x30  GPIO Trigger De-bounce Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |IOTGDBSEL |GPIO Trigger Pin De-bounce Sampling Cycle Selection
     * |        |          |0000 = Sample GPIO input once per 1 clock.
