zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
     * |        |          |0001 = Sample GPIO input once per 2 clocks.
     * |        |          |0010 = Sample GPIO input once per 4 clocks.
     * |        |          |0011 = Sample GPIO input once per 8 clocks.
     * |        |          |0100 = Sample GPIO input once per 16 clocks.
     * |        |          |0101 = Sample GPIO input once per 32 clocks.
     * |        |          |0110 = Sample GPIO input once per 64 clocks.
     * |        |          |0111 = Sample GPIO input once per 128 clocks.
     * |        |          |1000 = Sample GPIO input once per 256 clocks.
     * |        |          |1001 = Sample GPIO input once per 2*256 clocks.
     * |        |          |1010 = Sample GPIO input once per 4*256 clocks.
     * |        |          |1011 = Sample GPIO input once per 8*256 clocks.
     * |        |          |1100 = Sample GPIO input once per 16*256 clocks.
     * |        |          |1101 = Sample GPIO input once per 32*256 clocks.
     * |        |          |1110 = Sample GPIO input once per 64*256 clocks.
     * |        |          |1111 = Sample GPIO input once per 128*256 clocks.
     * |        |          |Note 1: De-bounce counter clock source is the 32 kHz internal low speed RC oscillator (LIRC).
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[31]    |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If PMC_IOTGDBCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.
     * |        |          |0 = PMC_ IOTGDBCTL register is ready for write operation.
     * |        |          |1 = PMC_ IOTGDBCTL register is busy on the last write operation. Other write operations are ignored.
     * @var PMC_T::GPATGCTL
     * Offset: 0x34  GPA Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TGPWKEN   |GPA Trigger Pin Wake-up Enable Bit
     * |        |          |0 = GPA group trigger pin wake-up chip Disabled, trigger ip Enabled.
     * |        |          |1 = GPA group trigger pin wake-up chip Enabled, trigger ip Enabled.
     * |        |          |Note 1: The GPA Trigger Pin wake-up is always enable when D2PGEN(PMC_PWRCTL[2] is 1.
     * |        |          |Note 2: This bit is not retained when D2 power is turned off.
     * |[1]     |TGPREN    |GPA Trigger Pin Rising Edge Enable Bit
     * |        |          |0 = GPA group trigger pin rising edge trigger function Disabled.
     * |        |          |1 = GPA group trigger pin rising edge trigger function Enabled.
     * |        |          |Note 1: Write operation is ignored when WRBUSY is high
     * |        |          |Note 2: This bit is not retained when D3 power is turned off.
     * |[2]     |TGPFEN    |GPA Trigge Pin Falling Edge Enable Bit
     * |        |          |0 = GPA group trigger pin falling edge trigger function Disabled.
     * |        |          |1 = GPA group trigger pin falling edge trigger function Enabled.
     * |        |          |Note 1: Write operation is ignored when WRBUSY is high
     * |        |          |Note 2: This bit is not retained when D3 power is turned off.
     * |[3]     |TGPDBEN   |GPA Trigger Pin Input Signal De-bounce Enable Bit
     * |        |          |The DBEN bit is used to enable the de-bounce function for each corresponding I/O
     * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger and wake-up.The de-bounce clock source is the 32 kHz internal low speed RC oscillator (LIRC).
     * |        |          |0 = Trigger pin De-bounce function Disabled.
     * |        |          |1 = Trigger pin De-bounce function Enabled.
     * |        |          |Note 1: The 32 kHz internal low speed RC oscillator (LIRC) will automatically be enabled if TGPDBEN is 1.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * |[7:4]   |TGPSEL    |GPA Trigger Pin Select
     * |        |          |0000 = GPA.0 trigger function Enabled.
     * |        |          |0001 = GPA.1 trigger function Enabled.
     * |        |          |0010 = GPA.2 trigger function Enabled.
     * |        |          |0011 = GPA.3 trigger function Enabled.
     * |        |          |0100 = GPA.4 trigger function Enabled.
     * |        |          |0101 = GPA.5 trigger function Enabled.
     * |        |          |0110 = GPA.6 trigger function Enabled.
     * |        |          |0111 = GPA.7 trigger function Enabled.
     * |        |          |1000 = GPA.8 trigger function Enabled.
     * |        |          |1001 = GPA.9 trigger function Enabled.
     * |        |          |1010 = GPA.10 trigger function Enabled.
     * |        |          |1011 = GPA.11 trigger function Enabled.
     * |        |          |1100 = GPA.12 trigger function Enabled.
     * |        |          |1101 = GPA.13 trigger function Enabled.
     * |        |          |1110 = GPA.14 trigger function Enabled.
     * |        |          |1111 = GPA.15 trigger function Enabled.
     * |        |          |Note: These bits are not retained when D3 power is turned off.
     * |[31]    |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If PMC_GPATGCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.
     * |        |          |0 = PMC_ GPATGCTL register is ready for write operation.
     * |        |          |1 = PMC_ GPATGCTL register is busy on the last write operation. Other write operations are ignored.
     * @var PMC_T::GPBTGCTL
     * Offset: 0x38  GPB Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TGPWKEN   |GPB Trigger Pin Wake-up Enable Bit
     * |        |          |0 = GPB group trigger pin wake-up chip Disabled, trigger ip Enabled.
     * |        |          |1 = GPB group trigger pin wake-up chip Enabled, trigger ip Enabled.
     * |        |          |Note 1: The GPB Trigger Pin wake-up is always enable when D2PGEN(PMC_PWRCTL[2] is 1.
     * |        |          |Note 2: This bit is not retained when D2 power is turned off.
     * |[1]     |TGPREN    |GPB Trigger Pin Rising Edge Enable Bit
     * |        |          |0 = GPB group trigger pin rising edge trigger function Disabled.
     * |        |          |1 = GPB group trigger pin rising edge trigger function Enabled.
     * |        |          |Note 1: Write operation is ignored when WRBUSY is high
     * |        |          |Note 2: This bit is not retained when D3 power is turned off.
     * |[2]     |TGPFEN    |GPB Trigge Pin Falling Edge Enable Bit
     * |        |          |0 = GPB group trigger pin falling edge trigger function Disabled.
     * |        |          |1 = GPB group trigger pin falling edge trigger function Enabled.
     * |        |          |Note: This bit is not retained when D3 power is turned off.
     * |[3]     |TGPDBEN   |GPB Trigger Pin Input Signal De-bounce Enable Bit
     * |        |          |The DBEN bit is used to enable the de-bounce function for each corresponding I/O
     * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger and wake-up.The de-bounce clock source is the 32 kHz internal low speed RC oscillator (LIRC).
     * |        |          |0 = Trigger pin De-bounce function Disabled.
     * |        |          |1 = Trigger pin De-bounce function Enabled.
     * |        |          |Note 1: The 32 kHz internal low speed RC oscillator (LIRC) will automatically be enabled if TGPDBEN is 1.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * |[7:4]   |TGPSEL    |GPB Trigger Pin Select
     * |        |          |0000 = GPB.0 trigger function Enabled.
     * |        |          |0001 = GPB.1 trigger function Enabled.
     * |        |          |0010 = GPB.2 trigger function Enabled.
     * |        |          |0011 = GPB.3 trigger function Enabled.
     * |        |          |0100 = GPB.4 trigger function Enabled.
     * |        |          |0101 = GPB.5 trigger function Enabled.
     * |        |          |0110 = GPB.6 trigger function Enabled.
     * |        |          |0111 = GPB.7 trigger function Enabled.
     * |        |          |1000 = GPB.8 trigger function Enabled.
     * |        |          |1001 = GPB.9 trigger function Enabled.
     * |        |          |1010 = GPB.10 trigger function Enabled.
     * |        |          |1011 = GPB.11 trigger function Enabled.
     * |        |          |1100 = GPB.12 trigger function Enabled.
     * |        |          |1101 = GPB.13 trigger function Enabled.
     * |        |          |1110 = GPB.14 trigger function Enabled.
     * |        |          |1111 = GPB.15 trigger function Enabled.
     * |        |          |Note: These bits are not retained when D3 power is turned off.
     * |[31]    |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If PMC_GPBTGCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.
     * |        |          |0 = PMC_ GPBTGCTL register is ready for write operation.
     * |        |          |1 = PMC_ GPBTGCTL register is busy on the last write operation. Other write operations are ignored.
     * @var PMC_T::GPCTGCTL
     * Offset: 0x3C  GPC Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TGPWKEN   |GPC Trigger Pin Wake-up Enable Bit
     * |        |          |0 = GPC group trigger pin wake-up chip Disabled, trigger ip Enabled.
     * |        |          |1 = GPC group trigger pin wake-up chip Enabled, trigger ip Enabled.
     * |        |          |Note 1: The GPC Trigger Pin wake-up is always enable when D2PGEN(PMC_PWRCTL[2] is 1.
     * |        |          |Note 2: This bit is not retained when D2 power is turned off.
     * |[1]     |TGPREN    |GPC Trigger Pin Rising Edge Enable Bit
     * |        |          |0 = GPC group trigger pin rising edge trigger function Disabled.
     * |        |          |1 = GPC group trigger pin rising edge trigger function Enabled.
     * |        |          |Note 1: Write operation is ignored when WRBUSY is high
     * |        |          |Note 2: This bit is not retained when D3 power is turned off.
     * |[2]     |TGPFEN    |GPC Trigge Pin Falling Edge Enable Bit
     * |        |          |0 = GPC group trigger pin falling edge trigger function Disabled.
     * |        |          |1 = GPC group trigger pin falling edge trigger function Enabled.
     * |        |          |Note 1: Write operation is ignored when WRBUSY is high
     * |        |          |Note 2: This bit is not retained when D3 power is turned off.
     * |[3]     |TGPDBEN   |GPC Trigger Pin Input Signal De-bounce Enable Bit
     * |        |          |The TGPDBEN bit is used to enable the de-bounce function for each corresponding I/O
     * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger and wake-up.The de-bounce clock source is the 32 kHz internal low speed RC oscillator (LIRC).
     * |        |          |0 = Trigger pin De-bounce function Disabled.
     * |        |          |1 = Trigger pin De-bounce function Enabled.
     * |        |          |Note 1: The 32 kHz internal low speed RC oscillator (LIRC) will automatically be enabled if TGPDBEN is 1.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * |[7:4]   |TGPSEL    |GPC Trigger Pin Select
     * |        |          |0000 = GPC.0 trigger function Enabled.
     * |        |          |0001 = GPC.1 trigger function Enabled.
     * |        |          |0010 = GPC.2 trigger function Enabled.
     * |        |          |0011 = GPC.3 trigger function Enabled.
     * |        |          |0100 = GPC.4 trigger function Enabled.
     * |        |          |0101 = GPC.5 trigger function Enabled.
     * |        |          |0110 = GPC.6 trigger function Enabled.
     * |        |          |0111 = GPC.7 trigger function Enabled.
     * |        |          |1000 = GPC.8 trigger function Enabled.
     * |        |          |1001 = GPC.9 trigger function Enabled.
     * |        |          |1010 = GPC.10 trigger function Enabled.
     * |        |          |1011 = GPC.11 trigger function Enabled.
     * |        |          |1100 = GPC.12 trigger function Enabled.
     * |        |          |1101 = GPC.13 trigger function Enabled.
     * |        |          |1110 = GPC.14 trigger function Enabled.
     * |        |          |1111 = Reserved.
     * |        |          |Note: These bits are not retained when D3 power is turned off.
     * |[31]    |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If PMC_GPCTGCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.
     * |        |          |0 = PMC_ GPCTGCTL register is ready for write operation.
     * |        |          |1 = PMC_ GPCTGCTL register is busy on the last write operation. Other write operations are ignored.
     * @var PMC_T::GPDTGCTL
     * Offset: 0x40  GPD Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TGPWKEN   |GPD Trigger Pin Wake-up Enable Bit
     * |        |          |0 = GPD group trigger pin wake-up chip Disabled, trigger ip Enabled.
     * |        |          |1 = GPD group trigger pin wake-up chip Enabled, trigger ip Enabled.
     * |        |          |Note 1: The GPD Trigger Pin wake-up is always enable when D2PGEN(PMC_PWRCTL[2] is 1.
     * |        |          |Note 2: This bit is not retained when D2 power is turned off.
     * |[1]     |TGPREN    |GPD Trigger Pin Rising Edge Enable Bit
     * |        |          |0 = GPD group trigger pin rising edge trigger function Disabled.
     * |        |          |1 = GPD group trigger pin rising edge trigger function Enabled.
     * |        |          |Note 1: Write operation is ignored when WRBUSY is high
     * |        |          |Note 2: This bit is not retained when D3 power is turned off.
     * |[2]     |TGPFEN    |GPD Trigge Pin Falling Edge Enable Bit
     * |        |          |0 = GPD group trigger pin falling edge trigger function Disabled.
     * |        |          |1 = GPD group trigger pin falling edge trigger function Enabled.
     * |        |          |Note 1: Write operation is ignored when WRBUSY is high
     * |        |          |Note 2: This bit is not retained when D3 power is turned off.
     * |[3]     |TGPDBEN   |GPD Trigger Pin Input Signal De-bounce Enable Bit
     * |        |          |The DBEN bit is used to enable the de-bounce function for each corresponding I/O
     * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger and wake-up.The de-bounce clock source is the 32 kHz internal low speed RC oscillator (LIRC).
     * |        |          |0 = Trigger pin De-bounce function Disabled.
     * |        |          |1 = Trigger pin De-bounce function Enabled.
     * |        |          |Note 1: The 32 kHz internal low speed RC oscillator (LIRC) will automatically be enabled if TGPDBEN is 1.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high
     * |        |          |Note 3: This bit is not retained when D3 power is turned off.
     * |[7:4]   |TGPSEL    |GPD Trigger Pin Select
     * |        |          |0000 = GPD.0 trigger function Enabled.
     * |        |          |0001 = GPD.1 trigger function Enabled.
     * |        |          |0010 = GPD.2 trigger function Enabled.
     * |        |          |0011 = GPD.3 trigger function Enabled.
     * |        |          |0100 = GPD.4 trigger function Enabled.
     * |        |          |0101 = GPD.5 trigger function Enabled.
     * |        |          |0110 = GPD.6 trigger function Enabled.
     * |        |          |0111 = GPD.7 trigger function Enabled.
     * |        |          |1000 = GPD.8 trigger function Enabled.
     * |        |          |1001 = GPD.9 trigger function Enabled.
     * |        |          |1010 = GPD.10 trigger function Enabled.
     * |        |          |1011 = GPD.11 trigger function Enabled.
     * |        |          |1100 = GPD.12 trigger function Enabled.
     * |        |          |1101 = GPD.13 trigger function Enabled.
     * |        |          |1110 = GPD.14 trigger function Enabled.
     * |        |          |1111 = Reserved.
     * |        |          |Note: These bits are not retained when D3 power is turned off.
     * |[31]    |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If PMC_GPDTGCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.
     * |        |          |0 = PMC_ GPDTGCTL register is ready for write operation.
     * |        |          |1 = PMC_ GPDTGCTL register is busy on the last write operation. Other write operations are ignored.
     * @var PMC_T::STMRWKCTL
     * Offset: 0x50  Standby Timer Wake-up Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |STMREN    |Standby Timer Enable Bit (Write Protect)
     * |        |          |0 = Standby timer disabled.
     * |        |          |1 = Standby timer Enabled.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[1]     |STMRMOD   |Standby Timer Mode (Write Protect)
     * |        |          |0 = Standby timer start when enter any of Power-down mode ( except CPU idle mode).
     * |        |          |1 = Standby timer start immedially when STMREN (PMC_STMRWKCTL[0]) =1.
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: This bit is not retained when D4 power is turned off.
     * |[11:8]  |STMRIS    |Stadnby Timer Time-out Interval Select (Write Protect)
     * |        |          |These bits control standby timer time-out interval when chip at Power-down mode.
     * |        |          |0000 = Time-out interval is 512 LIRC clocks (16ms).
     * |        |          |0001 = Time-out interval is 1024 LIRC clocks (32ms).
     * |        |          |0010 = Time-out interval is 2048 LIRC clocks (64ms).
     * |        |          |0011 = Time-out interval is 4096 LIRC clocks (128ms).
     * |        |          |0100 = Time-out interval is 8192 LIRC clocks (256ms).
     * |        |          |0101 = Time-out interval is 16384 LIRC clocks (512ms).
     * |        |          |0110 = Time-out interval is 32768 LIRC clocks (1024ms).
     * |        |          |0111 = Time-out interval is 65536 LIRC clocks (2048ms).
     * |        |          |1000 = Time-out interval is 131072 LIRC clocks (4096ms).
     * |        |          |1001 = Time-out interval is 262144 LIRC clocks (8192ms).
     * |        |          |1010 = Time-out interval is 524288 LIRC clocks (16384ms).
     * |        |          |1011 = Time-out interval is 1048576 LIRC clocks (32768ms).
     * |        |          |1100 = Time-out interval is 2097152 LIRC clocks (65536ms).
     * |        |          |1101 = Time-out interval is 4194304 LIRC clocks (131072ms).
     * |        |          |Others = Time-out interval is 512 LIRC clocks (16ms).
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when WRBUSY is high.
     * |        |          |Note 3: These bits are not retained when D4 power is turned off.
     * |[31]    |WRBUSY    |Write Busy Flag (Read Only)
     * |        |          |If PMC_STMRWKCTL is written, this bit is asserted automatically by hardware, and is de-asserted when write procedure is finished.
     * |        |          |0 = PMC_ STMRWKCTL register is ready for write operation.
     * |        |          |1 = PMC_ STMRWKCTL register is busy on the last write operation. Other write operations are ignored.
     * @var PMC_T::PINWKCTL
     * Offset: 0x60  Pin Wake-up Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |WKPINEN0  |Wake-up Pin0 Enable Bit (Write Protect)
     * |        |          |This is control register for GPC.0 to wake-up pin.
     * |        |          |00 = Wake-up pin disable.
     * |        |          |01 = Wake-up pin rising edge enabled.
     * |        |          |10 = Wake-up pin falling edge enabled.
     * |        |          |11 = Wake-up pin both edge enabled.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D4 power is turned off.
     * |[3:2]   |WKPINEN1  |Wake-up Pin1 Enable Bit (Write Protect)
     * |        |          |This is control register for GPB.0 to wake-up pin.
     * |        |          |00 = Wake-up pin disable.
     * |        |          |01 = Wake-up pin rising edge enabled.
     * |        |          |10 = Wake-up pin falling edge enabled.
     * |        |          |11 = Wake-up pin both edge enabled.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D4 power is turned off.
     * |[5:4]   |WKPINEN2  |Wake-up Pin2 Enable Bit (Write Protect)
     * |        |          |This is control register for GPB.2 to wake-up pin.
     * |        |          |00 = Wake-up pin disable.
     * |        |          |01 = Wake-up pin rising edge enabled.
     * |        |          |10 = Wake-up pin falling edge enabled.
     * |        |          |11 = Wake-up pin both edge enabled.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D4 power is turned off.
     * |[7:6]   |WKPINEN3  |Wake-up Pin3 Enable Bit (Write Protect)
     * |        |          |This is control register for GPB.12 to wake-up pin.
