zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
     * |        |          |00 = Wake-up pin disable.
     * |        |          |01 = Wake-up pin rising edge enabled.
     * |        |          |10 = Wake-up pin falling edge enabled.
     * |        |          |11 = Wake-up pin both edge enabled.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D4 power is turned off.
     * |[9:8]   |WKPINEN4  |Wake-up Pin4 Enable Bit (Write Protect)
     * |        |          |This is control register for GPF.6 to wake-up pin.
     * |        |          |00 = Wake-up pin disable.
     * |        |          |01 = Wake-up pin rising edge enabled.
     * |        |          |10 = Wake-up pin falling edge enabled.
     * |        |          |11 = Wake-up pin both edge enabled.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D4 power is turned off.
     * |        |          |Note 3: Setting IOCTLSEL(RTC_LXTCTL[8]) to avoid GPF6 unexpected falling edge.
     * |[11:10] |WKPINEN5  |Wake-up Pin5 Enable Bit (Write Protect)
     * |        |          |This is control register for GPA.12 to wake-up pin.
     * |        |          |00 = Wake-up pin disable.
     * |        |          |01 = Wake-up pin rising edge enabled.
     * |        |          |10 = Wake-up pin falling edge enabled.
     * |        |          |11 = Wake-up pin both edge enabled.
     * |        |          |Note 1: These bits are write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: These bits are not retained when D4 power is turned off.
     * @var PMC_T::SYSRB0PC
     * Offset: 0x100  System SRAM Bank 0 Power Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |SRAM0PMS  |System SRAM0 In Bank0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM0 in bank0 (64k) power mode for range 0x2010_0000 - 0x2010_FFFF.
     * |        |          |00 = System SRAM0 in bank0 is normal mode.
     * |        |          |01 = System SRAM0 in bank0 is retention mode.
     * |        |          |10 = System SRAM0 in bank0 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[3:2]   |SRAM1PMS  |System SRAM1 In Bank0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM1 in bank0 (64k) power mode for range 0x2011_0000 - 0x2011_FFFF.
     * |        |          |00 = System SRAM1 in bank0 is normal mode.
     * |        |          |01 = System SRAM1 in bank0 is retention mode.
     * |        |          |10 = System SRAM1 in bank0 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[5:4]   |SRAM2PMS  |System SRAM2 In Bank0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM2 in bank0 (64k) power mode for range 0x2012_0000 - 0x2012_FFFF.
     * |        |          |00 = System SRAM2 in bank0 is normal mode.
     * |        |          |01 = System SRAM2 in bank0 is retention mode.
     * |        |          |10 = System SRAM2 in bank0 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[7:6]   |SRAM3PMS  |System SRAM3 In Bank0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM3 in bank0 (64k) power mode for range 0x2013_0000 - 0x2013_FFFF.
     * |        |          |00 = System SRAM3 in bank0 is normal mode.
     * |        |          |01 = System SRAM3 in bank0 is retention mode.
     * |        |          |10 = System SRAM3 in bank0 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3.: These bits are not retained when D3 power is turned off.
     * |[9:8]   |SRAM4PMS  |System SRAM4 In Bank0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM4 in bank0 (64k) power mode for range 0x2014_0000 - 0x2014_FFFF.
     * |        |          |00 = System SRAM4 in bank0 is normal mode.
     * |        |          |01 = System SRAM4 in bank0 is retention mode.
     * |        |          |10 = System SRAM4 in bank0 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[11:10] |SRAM5PMS  |System SRAM5 In Bank0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM5 in bank0 (64k) power mode for range 0x2015_0000 - 0x2015_FFFF.
     * |        |          |00 = System SRAM5 in bank0 is normal mode.
     * |        |          |01 = System SRAM5 in bank0 is retention mode.
     * |        |          |10 = System SRAM5 in bank0 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[13:12] |SRAM6PMS  |System SRAM6 In Bank0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM6 in bank0 (64k) power mode for range 0x2016_0000 - 0x2016_FFFF.
     * |        |          |00 = System SRAM6 in bank0 is normal mode.
     * |        |          |01 = System SRAM6 in bank0 is retention mode.
     * |        |          |10 = System SRAM6 in bank0 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[15:14] |SRAM7PMS  |System SRAM7 In Bank0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM7 in bank0 (64k) power mode for range 0x2017_0000 - 0x2017_FFFF.
     * |        |          |00 = System SRAM7 in bank0 is normal mode.
     * |        |          |01 = System SRAM7 in bank0 is retention mode.
     * |        |          |10 = System SRAM7 in bank0 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D3 power is turned off.
     * |[31]    |PCBUSY    |Power Changing Busy Flag (Read Only)
     * |        |          |If PMC_SYSRB0PC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.
     * |        |          |0 = System SRAM bank 0 power change finished.
     * |        |          |1 = System SRAM bank 0 power changing. The PMC_SYSRB0PC write operations are ignored.
     * |        |          |set to power shut down mode by hardware.
     * |        |          |Note 1: This bit is not retained when D3 power is turned off.
     * @var PMC_T::SYSRB1PC
     * Offset: 0x104  System SRAM Bank 1 Power Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |SRAM0PMS  |System SRAM0 In Bank1 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM0 in bank1 (64k) power mode for range 0x2018_0000 - 0x2018_FFFF.
     * |        |          |00 = System SRAM0 in bank1 is normal mode.
     * |        |          |01 = System SRAM0 in bank1 is retention mode.
     * |        |          |10 = System SRAM0 in bank1 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[3:2]   |SRAM1PMS  |System SRAM1 In Bank1 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM1 in bank1 (64k) power mode for range 0x2019_0000 - 0x2019_FFFF.
     * |        |          |00 = System SRAM1 in bank1 is normal mode.
     * |        |          |01 = System SRAM1 in bank1 is retention mode.
     * |        |          |10 = System SRAM1 in bank1 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[5:4]   |SRAM2PMS  |System SRAM2 In Bank1 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM2 in bank1 (64k) power mode for range 0x201A_0000 - 0x201A_FFFF.
     * |        |          |00 = System SRAM2 in bank1 is normal mode.
     * |        |          |01 = System SRAM2 in bank1 is retention mode.
     * |        |          |10 = System SRAM2 in bank1 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[7:6]   |SRAM3PMS  |System SRAM3 In Bank1 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM3 in bank1 (64k) power mode for range 0x201B_0000 - 0x201B_FFFF.
     * |        |          |00 = System SRAM3 in bank1 is normal mode.
     * |        |          |01 = System SRAM3 in bank1 is retention mode.
     * |        |          |10 = System SRAM3 in bank1 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[9:8]   |SRAM4PMS  |System SRAM4 In Bank1 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM4 in bank1 (64k) power mode for range 0x201C_0000 - 0x201C_FFFF.
     * |        |          |00 = System SRAM4 in bank1 is normal mode.
     * |        |          |01 = System SRAM4 in bank1 is retention mode.
     * |        |          |10 = System SRAM4 in bank1 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[11:10] |SRAM5PMS  |System SRAM5 In Bank1 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM5 in bank1 (64k) power mode for range 0x201D_0000 - 0x201D_FFFF.
     * |        |          |00 = System SRAM5 in bank1 is normal mode.
     * |        |          |01 = System SRAM5 in bank1 is retention mode.
     * |        |          |10 = System SRAM5 in bank1 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[13:12] |SRAM6PMS  |System SRAM6 In Bank1 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM6 in bank1 (64k) power mode for range 0x201E_0000 - 0x201E_FFFF.
     * |        |          |00 = System SRAM6 in bank1 is normal mode.
     * |        |          |01 = System SRAM6 in bank1 is retention mode.
     * |        |          |10 = System SRAM6 in bank1 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[15:14] |SRAM7PMS  |System SRAM7 In Bank1 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM7 in bank1 (64k) power mode for range 0x201F_0000 - 0x201F_FFFF.
     * |        |          |00 = System SRAM7 in bank1 is normal mode.
     * |        |          |01 = System SRAM7 in bank1 is retention mode.
     * |        |          |10 = System SRAM7 in bank1 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[31]    |PCBUSY    |Power Changing Busy Flag (Read Only)
     * |        |          |If PMC_SYSRB1PC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.
     * |        |          |0 = System SRAM bank 1 power change finished.
     * |        |          |1 = System SRAM bank 1 power changing. The PMC_SYSRB1PC write operations are ignored.
     * |        |          |Note 1: This bit is not retained when D0 power is turned off.
     * @var PMC_T::SYSRB2PC
     * Offset: 0x108  System SRAM Bank 2 Power Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |SRAM0PMS  |System SRAM0 In Bank2 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM0 in bank2 (64k) power mode for range 0x2020_0000 - 0x2020_FFFF.
     * |        |          |00 = System SRAM0 in bank2 is normal mode.
     * |        |          |01 = System SRAM0 in bank2 is retention mode.
     * |        |          |10 = System SRAM0 in bank2 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[3:2]   |SRAM1PMS  |System SRAM1 In Bank2 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM1 in bank2 (64k) power mode for range 0x2021_0000 - 0x2021_FFFF.
     * |        |          |00 = System SRAM1 in bank2 is normal mode.
     * |        |          |01 = System SRAM1 in bank2 is retention mode.
     * |        |          |10 = System SRAM1 in bank2 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[5:4]   |SRAM2PMS  |System SRAM2 In Bank2 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM2 in bank2 (64k) power mode for range 0x2022_0000 - 0x2022_FFFF.
     * |        |          |00 = System SRAM2 in bank2 is normal mode.
     * |        |          |01 = System SRAM2 in bank2 is retention mode.
     * |        |          |10 = System SRAM2 in bank2 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[7:6]   |SRAM3PMS  |System SRAM3 In Bank2 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM3 in bank2 (64k) power mode for range 0x2023_0000 - 0x2023_FFFF.
     * |        |          |00 = System SRAM3 in bank2 is normal mode.
     * |        |          |01 = System SRAM3 in bank2 is retention mode.
     * |        |          |10 = System SRAM3 in bank2 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[9:8]   |SRAM4PMS  |System SRAM4 In Bank2 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM2 in bank1 (64k) power mode for range 0x2024_0000 - 0x2024_FFFF.
     * |        |          |00 = System SRAM4 in bank2 is normal mode.
     * |        |          |01 = System SRAM4 in bank2 is retention mode.
     * |        |          |10 = System SRAM4 in bank2 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D0PGEN(PMC_PWRCTL[0]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D0 power is turned off.
     * |[31]    |PCBUSY    |Power Changing Busy Flag (Read Only)
     * |        |          |If PMC_SYSRB2PC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.
     * |        |          |0 = System SRAM bank 2 power change finished.
     * |        |          |1 = System SRAM bank 2 power changing. The PMC_SYSRB2PC write operations are ignored.
     * |        |          |Note: This bit is not retained when D0 power is turned off.
     * @var PMC_T::SYSRB3PC
     * Offset: 0x10C  System SRAM Bank 3 Power Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |SRAM0PMS  |System SRAM0 In Bank3 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM0 in bank3 (8k) power mode for range 0x2030_0000 - 0x2030_1FFF.
     * |        |          |00 = System SRAM0 in bank3 is normal mode.
     * |        |          |01 = System SRAM0 in bank3 is retention mode.
     * |        |          |10 = System SRAM0 in bank3 is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D1PGEN(PMC_PWRCTL[1]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D1 power is turned off.
     * |[31]    |PCBUSY    |Power Changing Busy Flag (Read Only)
     * |        |          |If PMC_SYSRB3PC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.
     * |        |          |0 = System SRAM bank 3 power change finished.
     * |        |          |1 = System SRAM bank 3 power changing. The PMC_SYSRB0PC write operations are ignored.
