zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
     * |        |          |Note 1: This bit is not retained when D1 power is turned off.
     * @var PMC_T::LPSYSRPC
     * Offset: 0x110  Low Power Domain System SRAM Power Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |SRAM0PMS  |Low Power Domain SRAM0 Power Mode Select (Write Protect)
     * |        |          |This field can control SRAM0 (8k) power mode for range 0x2031_0000 - 0x2031_0FFF.
     * |        |          |00 = System SRAM0 in low power domain is normal mode.
     * |        |          |01 = System SRAM0 in low power domain is retention mode.
     * |        |          |10 = System SRAM0 in low power domain is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D3PGEN(PMC_PWRCTL[3]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D3 power is turned off.
     * |[31]    |PCBUSY    |Power Changing Busy Flag (Read Only)
     * |        |          |If PMC_LPSYSRPC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.
     * |        |          |0 = Low power domain SRAM bank 3 power change finished.
     * |        |          |1 = Low power domain power changing. The PMC_SYSLPRPC write operations are ignored.
     * |        |          |Note 1: This bit is not retained when D3 power is turned off.
     * @var PMC_T::CCAPRPC
     * Offset: 0x124  CCAP SRAM Power Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |CCAP0SRPMS|CCAP0 SRAM Power Mode Select (Write Protect)
     * |        |          |This field can control CCAP0 SRAM power mode.
     * |        |          |00 = CCAP0 SRAM is normal mode.
     * |        |          |01 = CCAP0 SRAM is retention mode.
     * |        |          |10 = CCAP0 SRAM is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D2 power is turned off.
     * |        |          |Note 4: This field only reset by POR reset.
     * |[31]    |PCBUSY    |Power Changing Busy Flag (Read Only)
     * |        |          |If PMC_CCAPRPC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.
     * |        |          |0 = CCAP SRAM power change finished.
     * |        |          |1 = CCAP SRAM power changing. The PMC_CCAPRPC write operations are ignored.
     * @var PMC_T::DMICRPC
     * Offset: 0x128  DMIC SRAM Power Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |DMIC0SRPMS|DMIC0 SRAM Power Mode Select (Write Protect)
     * |        |          |This field can control DMIC0 SRAM power mode.
     * |        |          |00 = DMIC0 SRAM is normal mode.
     * |        |          |01 = DMIC0 SRAM is retention mode.
     * |        |          |10 = DMIC0 SRAM is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: These bits are not retained when D2 power is turned off.
     * |        |          |Note 4: This field only reset by POR reset.
     * |[31]    |PCBUSY    |Power Changing Busy Flag (Read Only)
     * |        |          |If PMC_DMICRPC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.
     * |        |          |0 = DMIC SRAM power change finished.
     * |        |          |1 = DMIC SRAM power changing. The PMC_DMICRPC write operations are ignored.
     * @var PMC_T::KSRPC
     * Offset: 0x140  KS SRAM Power Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |KSSRPMS   |KS SRAM Power Mode Select (Write Protect)
     * |        |          |This field can control KS0 SRAM power mode.
     * |        |          |00 = KS SRAM is normal mode.
     * |        |          |01 = KS SRAM is retention mode.
     * |        |          |10 = KS SRAM is power shut down mode.
     * |        |          |11 = Reserved (Write Ignore).
     * |        |          |Note 1: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note 2: Write operation is ignored when PCBUSY is 1.
     * |        |          |Note 3: If system enter Power-down mode and D3PGEN(PMC_PWRCTL[3]) is set to 1, This SRAM is auto set to power shut down mode by hardware.
     * |        |          |Note 4: These bits are not retained when D3 power is turned off.
     * |        |          |Note 5: This field only reset by POR reset.
     * |[31]    |PCBUSY    |Power Changing Busy Flag (Read Only)
     * |        |          |If PMC_KSRPC is written, this bit is asserted automatically by hardware, and is de-asserted when SRAM power change procedure is finished.
     * |        |          |0 = KS SRAM power change finished.
     * |        |          |1 = KS SRAM power changing. The PMC_KSRPC write operations are ignored.
     */
    __IO uint32_t PWRCTL;                /*!< [0x0000] System Power-down Control Register                               */
    __IO uint32_t INTEN;                 /*!< [0x0004] PMC Interrupt Enable Register                                    */
    __IO uint32_t INTSTS;                /*!< [0x0008] PMC Interrupt Status Register                                    */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t PLCTL;                 /*!< [0x0010] Power Level Control Register                                     */
    __IO uint32_t PLSTS;                 /*!< [0x0014] Power Level Status Register                                      */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t IOSHCTL;               /*!< [0x0020] GPIO Status Hold Control Register                                */
    __I  uint32_t RESERVE2[1];
    __IO uint32_t BATLDCTL;              /*!< [0x0028] Battery Loss Detector Control Register                           */
    __I  uint32_t RESERVE3[1];
    __IO uint32_t IOTGDBCTL;             /*!< [0x0030] GPIO Trigger De-bounce Control Register                          */
    __IO uint32_t GPATGCTL;              /*!< [0x0034] GPA Trigger Control Register                                     */
    __IO uint32_t GPBTGCTL;              /*!< [0x0038] GPB Trigger Control Register                                     */
    __IO uint32_t GPCTGCTL;              /*!< [0x003c] GPC Trigger Control Register                                     */
    __IO uint32_t GPDTGCTL;              /*!< [0x0040] GPD Trigger Control Register                                     */
    __I  uint32_t RESERVE4[3];
    __IO uint32_t STMRWKCTL;             /*!< [0x0050] Standby Timer Wake-up Control Register                           */
    __I  uint32_t RESERVE5[3];
    __IO uint32_t PINWKCTL;              /*!< [0x0060] Pin Wake-up Control Register                                     */
    __I  uint32_t RESERVE6[39];
    __IO uint32_t SYSRB0PC;              /*!< [0x0100] System SRAM Bank 0 Power Mode Control Register                   */
    __IO uint32_t SYSRB1PC;              /*!< [0x0104] System SRAM Bank 1 Power Mode Control Register                   */
    __IO uint32_t SYSRB2PC;              /*!< [0x0108] System SRAM Bank 2 Power Mode Control Register                   */
    __IO uint32_t SYSRB3PC;              /*!< [0x010c] System SRAM Bank 3 Power Mode Control Register                   */
    __IO uint32_t LPSYSRPC;              /*!< [0x0110] Low Power Domain System SRAM Power Mode Control Register         */
    __I  uint32_t RESERVE7[4];
    __IO uint32_t CCAPRPC;               /*!< [0x0124] CCAP SRAM Power Mode Control Register                            */
    __IO uint32_t DMICRPC;               /*!< [0x0128] DMIC SRAM Power Mode Control Register                            */
    __I  uint32_t RESERVE8[5];
    __IO uint32_t KSRPC;                 /*!< [0x0140] KS SRAM Power Mode Control Register                              */

} PMC_T;

/**
    @addtogroup PMC_CONST PMC Bit Field Definition
    Constant Definitions for PMC Controller
@{ */

