zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
#define PMC_PWRCTL_D0PGEN_Pos            (0)                                               /*!< PMC_T::PWRCTL: D0PGEN Position         */
#define PMC_PWRCTL_D0PGEN_Msk            (0x1ul << PMC_PWRCTL_D0PGEN_Pos)                  /*!< PMC_T::PWRCTL: D0PGEN Mask             */

#define PMC_PWRCTL_D1PGEN_Pos            (1)                                               /*!< PMC_T::PWRCTL: D1PGEN Position         */
#define PMC_PWRCTL_D1PGEN_Msk            (0x1ul << PMC_PWRCTL_D1PGEN_Pos)                  /*!< PMC_T::PWRCTL: D1PGEN Mask             */

#define PMC_PWRCTL_D2PGEN_Pos            (2)                                               /*!< PMC_T::PWRCTL: D2PGEN Position         */
#define PMC_PWRCTL_D2PGEN_Msk            (0x1ul << PMC_PWRCTL_D2PGEN_Pos)                  /*!< PMC_T::PWRCTL: D2PGEN Mask             */

#define PMC_PWRCTL_D3PGEN_Pos            (3)                                               /*!< PMC_T::PWRCTL: D3PGEN Position         */
#define PMC_PWRCTL_D3PGEN_Msk            (0x1ul << PMC_PWRCTL_D3PGEN_Pos)                  /*!< PMC_T::PWRCTL: D3PGEN Mask             */

#define PMC_PWRCTL_AOCKPDEN_Pos          (8)                                               /*!< PMC_T::PWRCTL: AOCKPDEN Position       */
#define PMC_PWRCTL_AOCKPDEN_Msk          (0x1ul << PMC_PWRCTL_AOCKPDEN_Pos)                /*!< PMC_T::PWRCTL: AOCKPDEN Mask           */

#define PMC_PWRCTL_VDROPEN_Pos           (10)                                              /*!< PMC_T::PWRCTL: VDROPEN Position        */
#define PMC_PWRCTL_VDROPEN_Msk           (0x1ul << PMC_PWRCTL_VDROPEN_Pos)                 /*!< PMC_T::PWRCTL: VDROPEN Mask            */

#define PMC_PWRCTL_FWEN_Pos              (11)                                              /*!< PMC_T::PWRCTL: FWEN Position           */
#define PMC_PWRCTL_FWEN_Msk              (0x1ul << PMC_PWRCTL_FWEN_Pos)                    /*!< PMC_T::PWRCTL: FWEN Mask               */

#define PMC_PWRCTL_PRSTDBEN_Pos          (12)                                              /*!< PMC_T::PWRCTL: PRSTDBEN Position       */
#define PMC_PWRCTL_PRSTDBEN_Msk          (0x1ul << PMC_PWRCTL_PRSTDBEN_Pos)                /*!< PMC_T::PWRCTL: PRSTDBEN Mask           */

#define PMC_PWRCTL_WRBUSY_Pos            (31)                                              /*!< PMC_T::PWRCTL: WRBUSY Position         */
#define PMC_PWRCTL_WRBUSY_Msk            (0x1ul << PMC_PWRCTL_WRBUSY_Pos)                  /*!< PMC_T::PWRCTL: WRBUSY Mask             */

#define PMC_INTEN_PDWKIEN_Pos            (0)                                               /*!< PMC_T::INTEN: PDWKIEN Position         */
#define PMC_INTEN_PDWKIEN_Msk            (0x1ul << PMC_INTEN_PDWKIEN_Pos)                  /*!< PMC_T::INTEN: PDWKIEN Mask             */

#define PMC_INTEN_STMRWKIEN_Pos          (1)                                               /*!< PMC_T::INTEN: STMRWKIEN Position       */
#define PMC_INTEN_STMRWKIEN_Msk          (0x1ul << PMC_INTEN_STMRWKIEN_Pos)                /*!< PMC_T::INTEN: STMRWKIEN Mask           */

#define PMC_INTEN_PIN0WKIEN_Pos          (8)                                               /*!< PMC_T::INTEN: PIN0WKIEN Position       */
#define PMC_INTEN_PIN0WKIEN_Msk          (0x1ul << PMC_INTEN_PIN0WKIEN_Pos)                /*!< PMC_T::INTEN: PIN0WKIEN Mask           */

#define PMC_INTEN_PIN1WKIEN_Pos          (9)                                               /*!< PMC_T::INTEN: PIN1WKIEN Position       */
#define PMC_INTEN_PIN1WKIEN_Msk          (0x1ul << PMC_INTEN_PIN1WKIEN_Pos)                /*!< PMC_T::INTEN: PIN1WKIEN Mask           */

#define PMC_INTEN_PIN2WKIEN_Pos          (10)                                              /*!< PMC_T::INTEN: PIN2WKIEN Position       */
#define PMC_INTEN_PIN2WKIEN_Msk          (0x1ul << PMC_INTEN_PIN2WKIEN_Pos)                /*!< PMC_T::INTEN: PIN2WKIEN Mask           */

#define PMC_INTEN_PIN3WKIEN_Pos          (11)                                              /*!< PMC_T::INTEN: PIN3WKIEN Position       */
#define PMC_INTEN_PIN3WKIEN_Msk          (0x1ul << PMC_INTEN_PIN3WKIEN_Pos)                /*!< PMC_T::INTEN: PIN3WKIEN Mask           */

#define PMC_INTEN_PIN4WKIEN_Pos          (12)                                              /*!< PMC_T::INTEN: PIN4WKIEN Position       */
#define PMC_INTEN_PIN4WKIEN_Msk          (0x1ul << PMC_INTEN_PIN4WKIEN_Pos)                /*!< PMC_T::INTEN: PIN4WKIEN Mask           */

#define PMC_INTEN_PIN5WKIEN_Pos          (13)                                              /*!< PMC_T::INTEN: PIN5WKIEN Position       */
#define PMC_INTEN_PIN5WKIEN_Msk          (0x1ul << PMC_INTEN_PIN5WKIEN_Pos)                /*!< PMC_T::INTEN: PIN5WKIEN Mask           */

#define PMC_INTEN_GPATGWKIEN_Pos         (16)                                              /*!< PMC_T::INTEN: GPATGWKIEN Position      */
#define PMC_INTEN_GPATGWKIEN_Msk         (0x1ul << PMC_INTEN_GPATGWKIEN_Pos)               /*!< PMC_T::INTEN: GPATGWKIEN Mask          */

#define PMC_INTEN_GPBTGWKIEN_Pos         (17)                                              /*!< PMC_T::INTEN: GPBTGWKIEN Position      */
#define PMC_INTEN_GPBTGWKIEN_Msk         (0x1ul << PMC_INTEN_GPBTGWKIEN_Pos)               /*!< PMC_T::INTEN: GPBTGWKIEN Mask          */

#define PMC_INTEN_GPCTGWKIEN_Pos         (18)                                              /*!< PMC_T::INTEN: GPCTGWKIEN Position      */
#define PMC_INTEN_GPCTGWKIEN_Msk         (0x1ul << PMC_INTEN_GPCTGWKIEN_Pos)               /*!< PMC_T::INTEN: GPCTGWKIEN Mask          */

#define PMC_INTEN_GPDTGWKIEN_Pos         (19)                                              /*!< PMC_T::INTEN: GPDTGWKIEN Position      */
#define PMC_INTEN_GPDTGWKIEN_Msk         (0x1ul << PMC_INTEN_GPDTGWKIEN_Pos)               /*!< PMC_T::INTEN: GPDTGWKIEN Mask          */

#define PMC_INTSTS_PDWKIF_Pos            (0)                                               /*!< PMC_T::INTSTS: PDWKIF Position         */
#define PMC_INTSTS_PDWKIF_Msk            (0x1ul << PMC_INTSTS_PDWKIF_Pos)                  /*!< PMC_T::INTSTS: PDWKIF Mask             */

#define PMC_INTSTS_STMRWKIF_Pos          (1)                                               /*!< PMC_T::INTSTS: STMRWKIF Position       */
#define PMC_INTSTS_STMRWKIF_Msk          (0x1ul << PMC_INTSTS_STMRWKIF_Pos)                /*!< PMC_T::INTSTS: STMRWKIF Mask           */

