zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
#define PMC_INTSTS_PIN0WKIF_Pos          (8)                                               /*!< PMC_T::INTSTS: PIN0WKIF Position       */
#define PMC_INTSTS_PIN0WKIF_Msk          (0x1ul << PMC_INTSTS_PIN0WKIF_Pos)                /*!< PMC_T::INTSTS: PIN0WKIF Mask           */

#define PMC_INTSTS_PIN1WKIF_Pos          (9)                                               /*!< PMC_T::INTSTS: PIN1WKIF Position       */
#define PMC_INTSTS_PIN1WKIF_Msk          (0x1ul << PMC_INTSTS_PIN1WKIF_Pos)                /*!< PMC_T::INTSTS: PIN1WKIF Mask           */

#define PMC_INTSTS_PIN2WKIF_Pos          (10)                                              /*!< PMC_T::INTSTS: PIN2WKIF Position       */
#define PMC_INTSTS_PIN2WKIF_Msk          (0x1ul << PMC_INTSTS_PIN2WKIF_Pos)                /*!< PMC_T::INTSTS: PIN2WKIF Mask           */

#define PMC_INTSTS_PIN3WKIF_Pos          (11)                                              /*!< PMC_T::INTSTS: PIN3WKIF Position       */
#define PMC_INTSTS_PIN3WKIF_Msk          (0x1ul << PMC_INTSTS_PIN3WKIF_Pos)                /*!< PMC_T::INTSTS: PIN3WKIF Mask           */

#define PMC_INTSTS_PIN4WKIF_Pos          (12)                                              /*!< PMC_T::INTSTS: PIN4WKIF Position       */
#define PMC_INTSTS_PIN4WKIF_Msk          (0x1ul << PMC_INTSTS_PIN4WKIF_Pos)                /*!< PMC_T::INTSTS: PIN4WKIF Mask           */

#define PMC_INTSTS_PIN5WKIF_Pos          (13)                                              /*!< PMC_T::INTSTS: PIN5WKIF Position       */
#define PMC_INTSTS_PIN5WKIF_Msk          (0x1ul << PMC_INTSTS_PIN5WKIF_Pos)                /*!< PMC_T::INTSTS: PIN5WKIF Mask           */

#define PMC_INTSTS_GPATGWKIF_Pos         (16)                                              /*!< PMC_T::INTSTS: GPATGWKIF Position      */
#define PMC_INTSTS_GPATGWKIF_Msk         (0x1ul << PMC_INTSTS_GPATGWKIF_Pos)               /*!< PMC_T::INTSTS: GPATGWKIF Mask          */

#define PMC_INTSTS_GPBTGWKIF_Pos         (17)                                              /*!< PMC_T::INTSTS: GPBTGWKIF Position      */
#define PMC_INTSTS_GPBTGWKIF_Msk         (0x1ul << PMC_INTSTS_GPBTGWKIF_Pos)               /*!< PMC_T::INTSTS: GPBTGWKIF Mask          */

#define PMC_INTSTS_GPCTGWKIF_Pos         (18)                                              /*!< PMC_T::INTSTS: GPCTGWKIF Position      */
#define PMC_INTSTS_GPCTGWKIF_Msk         (0x1ul << PMC_INTSTS_GPCTGWKIF_Pos)               /*!< PMC_T::INTSTS: GPCTGWKIF Mask          */

#define PMC_INTSTS_GPDTGWKIF_Pos         (19)                                              /*!< PMC_T::INTSTS: GPDTGWKIF Position      */
#define PMC_INTSTS_GPDTGWKIF_Msk         (0x1ul << PMC_INTSTS_GPDTGWKIF_Pos)               /*!< PMC_T::INTSTS: GPDTGWKIF Mask          */

#define PMC_INTSTS_CLRWK_Pos             (31)                                              /*!< PMC_T::INTSTS: CLRWK Position          */
#define PMC_INTSTS_CLRWK_Msk             (0x1ul << PMC_INTSTS_CLRWK_Pos)                   /*!< PMC_T::INTSTS: CLRWK Mask              */

#define PMC_PLCTL_PLSEL_Pos              (0)                                               /*!< PMC_T::PLCTL: PLSEL Position           */
#define PMC_PLCTL_PLSEL_Msk              (0x3ul << PMC_PLCTL_PLSEL_Pos)                    /*!< PMC_T::PLCTL: PLSEL Mask               */

#define PMC_PLCTL_WRBUSY_Pos             (31)                                              /*!< PMC_T::PLCTL: WRBUSY Position          */
#define PMC_PLCTL_WRBUSY_Msk             (0x1ul << PMC_PLCTL_WRBUSY_Pos)                   /*!< PMC_T::PLCTL: WRBUSY Mask              */

#define PMC_PLSTS_PLSTATUS_Pos           (0)                                               /*!< PMC_T::PLSTS: PLSTATUS Position        */
#define PMC_PLSTS_PLSTATUS_Msk           (0x3ul << PMC_PLSTS_PLSTATUS_Pos)                 /*!< PMC_T::PLSTS: PLSTATUS Mask            */

#define PMC_PLSTS_PLCBUSY_Pos            (31)                                              /*!< PMC_T::PLSTS: PLCBUSY Position         */
#define PMC_PLSTS_PLCBUSY_Msk            (0x1ul << PMC_PLSTS_PLCBUSY_Pos)                  /*!< PMC_T::PLSTS: PLCBUSY Mask             */

#define PMC_IOSHCTL_IOHR_Pos             (0)                                               /*!< PMC_T::IOSHCTL: IOHR Position          */
#define PMC_IOSHCTL_IOHR_Msk             (0x1ul << PMC_IOSHCTL_IOHR_Pos)                   /*!< PMC_T::IOSHCTL: IOHR Mask              */

#define PMC_BATLDCTL_BATLDEN_Pos         (0)                                               /*!< PMC_T::BATLDCTL: BATLDEN Position      */
#define PMC_BATLDCTL_BATLDEN_Msk         (0x1ul << PMC_BATLDCTL_BATLDEN_Pos)               /*!< PMC_T::BATLDCTL: BATLDEN Mask          */

#define PMC_IOTGDBCTL_IOTGDBSEL_Pos      (0)                                               /*!< PMC_T::IOTGDBCTL: IOTGDBSEL Position   */
#define PMC_IOTGDBCTL_IOTGDBSEL_Msk      (0xful << PMC_IOTGDBCTL_IOTGDBSEL_Pos)            /*!< PMC_T::IOTGDBCTL: IOTGDBSEL Mask       */

#define PMC_IOTGDBCTL_WRBUSY_Pos         (31)                                              /*!< PMC_T::IOTGDBCTL: WRBUSY Position      */
#define PMC_IOTGDBCTL_WRBUSY_Msk         (0x1ul << PMC_IOTGDBCTL_WRBUSY_Pos)               /*!< PMC_T::IOTGDBCTL: WRBUSY Mask          */

#define PMC_GPATGCTL_TGPWKEN_Pos         (0)                                               /*!< PMC_T::GPATGCTL: TGPWKEN Position      */
#define PMC_GPATGCTL_TGPWKEN_Msk         (0x1ul << PMC_GPATGCTL_TGPWKEN_Pos)               /*!< PMC_T::GPATGCTL: TGPWKEN Mask          */

#define PMC_GPATGCTL_TGPREN_Pos          (1)                                               /*!< PMC_T::GPATGCTL: TGPREN Position       */
#define PMC_GPATGCTL_TGPREN_Msk          (0x1ul << PMC_GPATGCTL_TGPREN_Pos)                /*!< PMC_T::GPATGCTL: TGPREN Mask           */

#define PMC_GPATGCTL_TGPFEN_Pos          (2)                                               /*!< PMC_T::GPATGCTL: TGPFEN Position       */
#define PMC_GPATGCTL_TGPFEN_Msk          (0x1ul << PMC_GPATGCTL_TGPFEN_Pos)                /*!< PMC_T::GPATGCTL: TGPFEN Mask           */

#define PMC_GPATGCTL_TGPDBEN_Pos         (3)                                               /*!< PMC_T::GPATGCTL: TGPDBEN Position      */
#define PMC_GPATGCTL_TGPDBEN_Msk         (0x1ul << PMC_GPATGCTL_TGPDBEN_Pos)               /*!< PMC_T::GPATGCTL: TGPDBEN Mask          */

