zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
#define PMC_GPATGCTL_TGPSEL_Pos          (4)                                               /*!< PMC_T::GPATGCTL: TGPSEL Position       */
#define PMC_GPATGCTL_TGPSEL_Msk          (0xful << PMC_GPATGCTL_TGPSEL_Pos)                /*!< PMC_T::GPATGCTL: TGPSEL Mask           */

#define PMC_GPATGCTL_WRBUSY_Pos          (31)                                              /*!< PMC_T::GPATGCTL: WRBUSY Position       */
#define PMC_GPATGCTL_WRBUSY_Msk          (0x1ul << PMC_GPATGCTL_WRBUSY_Pos)                /*!< PMC_T::GPATGCTL: WRBUSY Mask           */

#define PMC_GPBTGCTL_TGPWKEN_Pos         (0)                                               /*!< PMC_T::GPBTGCTL: TGPWKEN Position      */
#define PMC_GPBTGCTL_TGPWKEN_Msk         (0x1ul << PMC_GPBTGCTL_TGPWKEN_Pos)               /*!< PMC_T::GPBTGCTL: TGPWKEN Mask          */

#define PMC_GPBTGCTL_TGPREN_Pos          (1)                                               /*!< PMC_T::GPBTGCTL: TGPREN Position       */
#define PMC_GPBTGCTL_TGPREN_Msk          (0x1ul << PMC_GPBTGCTL_TGPREN_Pos)                /*!< PMC_T::GPBTGCTL: TGPREN Mask           */

#define PMC_GPBTGCTL_TGPFEN_Pos          (2)                                               /*!< PMC_T::GPBTGCTL: TGPFEN Position       */
#define PMC_GPBTGCTL_TGPFEN_Msk          (0x1ul << PMC_GPBTGCTL_TGPFEN_Pos)                /*!< PMC_T::GPBTGCTL: TGPFEN Mask           */

#define PMC_GPBTGCTL_TGPDBEN_Pos         (3)                                               /*!< PMC_T::GPBTGCTL: TGPDBEN Position      */
#define PMC_GPBTGCTL_TGPDBEN_Msk         (0x1ul << PMC_GPBTGCTL_TGPDBEN_Pos)               /*!< PMC_T::GPBTGCTL: TGPDBEN Mask          */

#define PMC_GPBTGCTL_TGPSEL_Pos          (4)                                               /*!< PMC_T::GPBTGCTL: TGPSEL Position       */
#define PMC_GPBTGCTL_TGPSEL_Msk          (0xful << PMC_GPBTGCTL_TGPSEL_Pos)                /*!< PMC_T::GPBTGCTL: TGPSEL Mask           */

#define PMC_GPBTGCTL_WRBUSY_Pos          (31)                                              /*!< PMC_T::GPBTGCTL: WRBUSY Position       */
#define PMC_GPBTGCTL_WRBUSY_Msk          (0x1ul << PMC_GPBTGCTL_WRBUSY_Pos)                /*!< PMC_T::GPBTGCTL: WRBUSY Mask           */

#define PMC_GPCTGCTL_TGPWKEN_Pos         (0)                                               /*!< PMC_T::GPCTGCTL: TGPWKEN Position      */
#define PMC_GPCTGCTL_TGPWKEN_Msk         (0x1ul << PMC_GPCTGCTL_TGPWKEN_Pos)               /*!< PMC_T::GPCTGCTL: TGPWKEN Mask          */

#define PMC_GPCTGCTL_TGPREN_Pos          (1)                                               /*!< PMC_T::GPCTGCTL: TGPREN Position       */
#define PMC_GPCTGCTL_TGPREN_Msk          (0x1ul << PMC_GPCTGCTL_TGPREN_Pos)                /*!< PMC_T::GPCTGCTL: TGPREN Mask           */

#define PMC_GPCTGCTL_TGPFEN_Pos          (2)                                               /*!< PMC_T::GPCTGCTL: TGPFEN Position       */
#define PMC_GPCTGCTL_TGPFEN_Msk          (0x1ul << PMC_GPCTGCTL_TGPFEN_Pos)                /*!< PMC_T::GPCTGCTL: TGPFEN Mask           */

#define PMC_GPCTGCTL_TGPDBEN_Pos         (3)                                               /*!< PMC_T::GPCTGCTL: TGPDBEN Position      */
#define PMC_GPCTGCTL_TGPDBEN_Msk         (0x1ul << PMC_GPCTGCTL_TGPDBEN_Pos)               /*!< PMC_T::GPCTGCTL: TGPDBEN Mask          */

#define PMC_GPCTGCTL_TGPSEL_Pos          (4)                                               /*!< PMC_T::GPCTGCTL: TGPSEL Position       */
#define PMC_GPCTGCTL_TGPSEL_Msk          (0xful << PMC_GPCTGCTL_TGPSEL_Pos)                /*!< PMC_T::GPCTGCTL: TGPSEL Mask           */

#define PMC_GPCTGCTL_WRBUSY_Pos          (31)                                              /*!< PMC_T::GPCTGCTL: WRBUSY Position       */
#define PMC_GPCTGCTL_WRBUSY_Msk          (0x1ul << PMC_GPCTGCTL_WRBUSY_Pos)                /*!< PMC_T::GPCTGCTL: WRBUSY Mask           */

#define PMC_GPDTGCTL_TGPWKEN_Pos         (0)                                               /*!< PMC_T::GPDTGCTL: TGPWKEN Position      */
#define PMC_GPDTGCTL_TGPWKEN_Msk         (0x1ul << PMC_GPDTGCTL_TGPWKEN_Pos)               /*!< PMC_T::GPDTGCTL: TGPWKEN Mask          */

#define PMC_GPDTGCTL_TGPREN_Pos          (1)                                               /*!< PMC_T::GPDTGCTL: TGPREN Position       */
#define PMC_GPDTGCTL_TGPREN_Msk          (0x1ul << PMC_GPDTGCTL_TGPREN_Pos)                /*!< PMC_T::GPDTGCTL: TGPREN Mask           */

#define PMC_GPDTGCTL_TGPFEN_Pos          (2)                                               /*!< PMC_T::GPDTGCTL: TGPFEN Position       */
#define PMC_GPDTGCTL_TGPFEN_Msk          (0x1ul << PMC_GPDTGCTL_TGPFEN_Pos)                /*!< PMC_T::GPDTGCTL: TGPFEN Mask           */

#define PMC_GPDTGCTL_TGPDBEN_Pos         (3)                                               /*!< PMC_T::GPDTGCTL: TGPDBEN Position      */
#define PMC_GPDTGCTL_TGPDBEN_Msk         (0x1ul << PMC_GPDTGCTL_TGPDBEN_Pos)               /*!< PMC_T::GPDTGCTL: TGPDBEN Mask          */

#define PMC_GPDTGCTL_TGPSEL_Pos          (4)                                               /*!< PMC_T::GPDTGCTL: TGPSEL Position       */
#define PMC_GPDTGCTL_TGPSEL_Msk          (0xful << PMC_GPDTGCTL_TGPSEL_Pos)                /*!< PMC_T::GPDTGCTL: TGPSEL Mask           */

#define PMC_GPDTGCTL_WRBUSY_Pos          (31)                                              /*!< PMC_T::GPDTGCTL: WRBUSY Position       */
#define PMC_GPDTGCTL_WRBUSY_Msk          (0x1ul << PMC_GPDTGCTL_WRBUSY_Pos)                /*!< PMC_T::GPDTGCTL: WRBUSY Mask           */

#define PMC_STMRWKCTL_STMREN_Pos         (0)                                               /*!< PMC_T::STMRWKCTL: STMREN Position      */
#define PMC_STMRWKCTL_STMREN_Msk         (0x1ul << PMC_STMRWKCTL_STMREN_Pos)               /*!< PMC_T::STMRWKCTL: STMREN Mask          */

#define PMC_STMRWKCTL_STMRMOD_Pos        (1)                                               /*!< PMC_T::STMRWKCTL: STMRMOD Position     */
#define PMC_STMRWKCTL_STMRMOD_Msk        (0x1ul << PMC_STMRWKCTL_STMRMOD_Pos)              /*!< PMC_T::STMRWKCTL: STMRMOD Mask         */

