zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
#define PMC_STMRWKCTL_STMRIS_Pos         (8)                                               /*!< PMC_T::STMRWKCTL: STMRIS Position      */
#define PMC_STMRWKCTL_STMRIS_Msk         (0xful << PMC_STMRWKCTL_STMRIS_Pos)               /*!< PMC_T::STMRWKCTL: STMRIS Mask          */

#define PMC_STMRWKCTL_WRBUSY_Pos         (31)                                              /*!< PMC_T::STMRWKCTL: WRBUSY Position      */
#define PMC_STMRWKCTL_WRBUSY_Msk         (0x1ul << PMC_STMRWKCTL_WRBUSY_Pos)               /*!< PMC_T::STMRWKCTL: WRBUSY Mask          */

#define PMC_PINWKCTL_WKPINEN0_Pos        (0)                                               /*!< PMC_T::PINWKCTL: WKPINEN0 Position     */
#define PMC_PINWKCTL_WKPINEN0_Msk        (0x3ul << PMC_PINWKCTL_WKPINEN0_Pos)              /*!< PMC_T::PINWKCTL: WKPINEN0 Mask         */

#define PMC_PINWKCTL_WKPINEN1_Pos        (2)                                               /*!< PMC_T::PINWKCTL: WKPINEN1 Position     */
#define PMC_PINWKCTL_WKPINEN1_Msk        (0x3ul << PMC_PINWKCTL_WKPINEN1_Pos)              /*!< PMC_T::PINWKCTL: WKPINEN1 Mask         */

#define PMC_PINWKCTL_WKPINEN2_Pos        (4)                                               /*!< PMC_T::PINWKCTL: WKPINEN2 Position     */
#define PMC_PINWKCTL_WKPINEN2_Msk        (0x3ul << PMC_PINWKCTL_WKPINEN2_Pos)              /*!< PMC_T::PINWKCTL: WKPINEN2 Mask         */

#define PMC_PINWKCTL_WKPINEN3_Pos        (6)                                               /*!< PMC_T::PINWKCTL: WKPINEN3 Position     */
#define PMC_PINWKCTL_WKPINEN3_Msk        (0x3ul << PMC_PINWKCTL_WKPINEN3_Pos)              /*!< PMC_T::PINWKCTL: WKPINEN3 Mask         */

#define PMC_PINWKCTL_WKPINEN4_Pos        (8)                                               /*!< PMC_T::PINWKCTL: WKPINEN4 Position     */
#define PMC_PINWKCTL_WKPINEN4_Msk        (0x3ul << PMC_PINWKCTL_WKPINEN4_Pos)              /*!< PMC_T::PINWKCTL: WKPINEN4 Mask         */

#define PMC_PINWKCTL_WKPINEN5_Pos        (10)                                              /*!< PMC_T::PINWKCTL: WKPINEN5 Position     */
#define PMC_PINWKCTL_WKPINEN5_Msk        (0x3ul << PMC_PINWKCTL_WKPINEN5_Pos)              /*!< PMC_T::PINWKCTL: WKPINEN5 Mask         */

#define PMC_SYSRB0PC_SRAM0PMS_Pos        (0)                                               /*!< PMC_T::SYSRB0PC: SRAM0PMS Position     */
#define PMC_SYSRB0PC_SRAM0PMS_Msk        (0x3ul << PMC_SYSRB0PC_SRAM0PMS_Pos)              /*!< PMC_T::SYSRB0PC: SRAM0PMS Mask         */

#define PMC_SYSRB0PC_SRAM1PMS_Pos        (2)                                               /*!< PMC_T::SYSRB0PC: SRAM1PMS Position     */
#define PMC_SYSRB0PC_SRAM1PMS_Msk        (0x3ul << PMC_SYSRB0PC_SRAM1PMS_Pos)              /*!< PMC_T::SYSRB0PC: SRAM1PMS Mask         */

#define PMC_SYSRB0PC_SRAM2PMS_Pos        (4)                                               /*!< PMC_T::SYSRB0PC: SRAM2PMS Position     */
#define PMC_SYSRB0PC_SRAM2PMS_Msk        (0x3ul << PMC_SYSRB0PC_SRAM2PMS_Pos)              /*!< PMC_T::SYSRB0PC: SRAM2PMS Mask         */

#define PMC_SYSRB0PC_SRAM3PMS_Pos        (6)                                               /*!< PMC_T::SYSRB0PC: SRAM3PMS Position     */
#define PMC_SYSRB0PC_SRAM3PMS_Msk        (0x3ul << PMC_SYSRB0PC_SRAM3PMS_Pos)              /*!< PMC_T::SYSRB0PC: SRAM3PMS Mask         */

#define PMC_SYSRB0PC_SRAM4PMS_Pos        (8)                                               /*!< PMC_T::SYSRB0PC: SRAM4PMS Position     */
#define PMC_SYSRB0PC_SRAM4PMS_Msk        (0x3ul << PMC_SYSRB0PC_SRAM4PMS_Pos)              /*!< PMC_T::SYSRB0PC: SRAM4PMS Mask         */

#define PMC_SYSRB0PC_SRAM5PMS_Pos        (10)                                              /*!< PMC_T::SYSRB0PC: SRAM5PMS Position     */
#define PMC_SYSRB0PC_SRAM5PMS_Msk        (0x3ul << PMC_SYSRB0PC_SRAM5PMS_Pos)              /*!< PMC_T::SYSRB0PC: SRAM5PMS Mask         */

#define PMC_SYSRB0PC_SRAM6PMS_Pos        (12)                                              /*!< PMC_T::SYSRB0PC: SRAM6PMS Position     */
#define PMC_SYSRB0PC_SRAM6PMS_Msk        (0x3ul << PMC_SYSRB0PC_SRAM6PMS_Pos)              /*!< PMC_T::SYSRB0PC: SRAM6PMS Mask         */

#define PMC_SYSRB0PC_SRAM7PMS_Pos        (14)                                              /*!< PMC_T::SYSRB0PC: SRAM7PMS Position     */
#define PMC_SYSRB0PC_SRAM7PMS_Msk        (0x3ul << PMC_SYSRB0PC_SRAM7PMS_Pos)              /*!< PMC_T::SYSRB0PC: SRAM7PMS Mask         */

#define PMC_SYSRB0PC_PCBUSY_Pos          (31)                                              /*!< PMC_T::SYSRB0PC: PCBUSY Position       */
#define PMC_SYSRB0PC_PCBUSY_Msk          (0x1ul << PMC_SYSRB0PC_PCBUSY_Pos)                /*!< PMC_T::SYSRB0PC: PCBUSY Mask           */

#define PMC_SYSRB1PC_SRAM0PMS_Pos        (0)                                               /*!< PMC_T::SYSRB1PC: SRAM0PMS Position     */
#define PMC_SYSRB1PC_SRAM0PMS_Msk        (0x3ul << PMC_SYSRB1PC_SRAM0PMS_Pos)              /*!< PMC_T::SYSRB1PC: SRAM0PMS Mask         */

#define PMC_SYSRB1PC_SRAM1PMS_Pos        (2)                                               /*!< PMC_T::SYSRB1PC: SRAM1PMS Position     */
#define PMC_SYSRB1PC_SRAM1PMS_Msk        (0x3ul << PMC_SYSRB1PC_SRAM1PMS_Pos)              /*!< PMC_T::SYSRB1PC: SRAM1PMS Mask         */

#define PMC_SYSRB1PC_SRAM2PMS_Pos        (4)                                               /*!< PMC_T::SYSRB1PC: SRAM2PMS Position     */
#define PMC_SYSRB1PC_SRAM2PMS_Msk        (0x3ul << PMC_SYSRB1PC_SRAM2PMS_Pos)              /*!< PMC_T::SYSRB1PC: SRAM2PMS Mask         */

#define PMC_SYSRB1PC_SRAM3PMS_Pos        (6)                                               /*!< PMC_T::SYSRB1PC: SRAM3PMS Position     */
#define PMC_SYSRB1PC_SRAM3PMS_Msk        (0x3ul << PMC_SYSRB1PC_SRAM3PMS_Pos)              /*!< PMC_T::SYSRB1PC: SRAM3PMS Mask         */

#define PMC_SYSRB1PC_SRAM4PMS_Pos        (8)                                               /*!< PMC_T::SYSRB1PC: SRAM4PMS Position     */
#define PMC_SYSRB1PC_SRAM4PMS_Msk        (0x3ul << PMC_SYSRB1PC_SRAM4PMS_Pos)              /*!< PMC_T::SYSRB1PC: SRAM4PMS Mask         */

#define PMC_SYSRB1PC_SRAM5PMS_Pos        (10)                                              /*!< PMC_T::SYSRB1PC: SRAM5PMS Position     */
#define PMC_SYSRB1PC_SRAM5PMS_Msk        (0x3ul << PMC_SYSRB1PC_SRAM5PMS_Pos)              /*!< PMC_T::SYSRB1PC: SRAM5PMS Mask         */

