zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/pmc_reg.h
#define PMC_SYSRB1PC_SRAM6PMS_Pos        (12)                                              /*!< PMC_T::SYSRB1PC: SRAM6PMS Position     */
#define PMC_SYSRB1PC_SRAM6PMS_Msk        (0x3ul << PMC_SYSRB1PC_SRAM6PMS_Pos)              /*!< PMC_T::SYSRB1PC: SRAM6PMS Mask         */

#define PMC_SYSRB1PC_SRAM7PMS_Pos        (14)                                              /*!< PMC_T::SYSRB1PC: SRAM7PMS Position     */
#define PMC_SYSRB1PC_SRAM7PMS_Msk        (0x3ul << PMC_SYSRB1PC_SRAM7PMS_Pos)              /*!< PMC_T::SYSRB1PC: SRAM7PMS Mask         */

#define PMC_SYSRB1PC_PCBUSY_Pos          (31)                                              /*!< PMC_T::SYSRB1PC: PCBUSY Position       */
#define PMC_SYSRB1PC_PCBUSY_Msk          (0x1ul << PMC_SYSRB1PC_PCBUSY_Pos)                /*!< PMC_T::SYSRB1PC: PCBUSY Mask           */

#define PMC_SYSRB2PC_SRAM0PMS_Pos        (0)                                               /*!< PMC_T::SYSRB2PC: SRAM0PMS Position     */
#define PMC_SYSRB2PC_SRAM0PMS_Msk        (0x3ul << PMC_SYSRB2PC_SRAM0PMS_Pos)              /*!< PMC_T::SYSRB2PC: SRAM0PMS Mask         */

#define PMC_SYSRB2PC_SRAM1PMS_Pos        (2)                                               /*!< PMC_T::SYSRB2PC: SRAM1PMS Position     */
#define PMC_SYSRB2PC_SRAM1PMS_Msk        (0x3ul << PMC_SYSRB2PC_SRAM1PMS_Pos)              /*!< PMC_T::SYSRB2PC: SRAM1PMS Mask         */

#define PMC_SYSRB2PC_SRAM2PMS_Pos        (4)                                               /*!< PMC_T::SYSRB2PC: SRAM2PMS Position     */
#define PMC_SYSRB2PC_SRAM2PMS_Msk        (0x3ul << PMC_SYSRB2PC_SRAM2PMS_Pos)              /*!< PMC_T::SYSRB2PC: SRAM2PMS Mask         */

#define PMC_SYSRB2PC_SRAM3PMS_Pos        (6)                                               /*!< PMC_T::SYSRB2PC: SRAM3PMS Position     */
#define PMC_SYSRB2PC_SRAM3PMS_Msk        (0x3ul << PMC_SYSRB2PC_SRAM3PMS_Pos)              /*!< PMC_T::SYSRB2PC: SRAM3PMS Mask         */

#define PMC_SYSRB2PC_SRAM4PMS_Pos        (8)                                               /*!< PMC_T::SYSRB2PC: SRAM4PMS Position     */
#define PMC_SYSRB2PC_SRAM4PMS_Msk        (0x3ul << PMC_SYSRB2PC_SRAM4PMS_Pos)              /*!< PMC_T::SYSRB2PC: SRAM4PMS Mask         */

#define PMC_SYSRB2PC_PCBUSY_Pos          (31)                                              /*!< PMC_T::SYSRB2PC: PCBUSY Position       */
#define PMC_SYSRB2PC_PCBUSY_Msk          (0x1ul << PMC_SYSRB2PC_PCBUSY_Pos)                /*!< PMC_T::SYSRB2PC: PCBUSY Mask           */

#define PMC_SYSRB3PC_SRAM0PMS_Pos        (0)                                               /*!< PMC_T::SYSRB3PC: SRAM0PMS Position     */
#define PMC_SYSRB3PC_SRAM0PMS_Msk        (0x3ul << PMC_SYSRB3PC_SRAM0PMS_Pos)              /*!< PMC_T::SYSRB3PC: SRAM0PMS Mask         */

#define PMC_SYSRB3PC_PCBUSY_Pos          (31)                                              /*!< PMC_T::SYSRB3PC: PCBUSY Position       */
#define PMC_SYSRB3PC_PCBUSY_Msk          (0x1ul << PMC_SYSRB3PC_PCBUSY_Pos)                /*!< PMC_T::SYSRB3PC: PCBUSY Mask           */

#define PMC_LPSYSRPC_SRAM0PMS_Pos        (0)                                               /*!< PMC_T::LPSYSRPC: SRAM0PMS Position     */
#define PMC_LPSYSRPC_SRAM0PMS_Msk        (0x3ul << PMC_LPSYSRPC_SRAM0PMS_Pos)              /*!< PMC_T::LPSYSRPC: SRAM0PMS Mask         */

#define PMC_LPSYSRPC_PCBUSY_Pos          (31)                                              /*!< PMC_T::LPSYSRPC: PCBUSY Position       */
#define PMC_LPSYSRPC_PCBUSY_Msk          (0x1ul << PMC_LPSYSRPC_PCBUSY_Pos)                /*!< PMC_T::LPSYSRPC: PCBUSY Mask           */

#define PMC_CCAPRPC_CCAP0SRPMS_Pos       (0)                                               /*!< PMC_T::CCAPRPC: CCAP0SRPMS Position    */
#define PMC_CCAPRPC_CCAP0SRPMS_Msk       (0x3ul << PMC_CCAPRPC_CCAP0SRPMS_Pos)             /*!< PMC_T::CCAPRPC: CCAP0SRPMS Mask        */

#define PMC_CCAPRPC_PCBUSY_Pos           (31)                                              /*!< PMC_T::CCAPRPC: PCBUSY Position        */
#define PMC_CCAPRPC_PCBUSY_Msk           (0x1ul << PMC_CCAPRPC_PCBUSY_Pos)                 /*!< PMC_T::CCAPRPC: PCBUSY Mask            */

#define PMC_DMICRPC_DMIC0SRPMS_Pos       (0)                                               /*!< PMC_T::DMICRPC: DMIC0SRPMS Position    */
#define PMC_DMICRPC_DMIC0SRPMS_Msk       (0x3ul << PMC_DMICRPC_DMIC0SRPMS_Pos)             /*!< PMC_T::DMICRPC: DMIC0SRPMS Mask        */

#define PMC_DMICRPC_PCBUSY_Pos           (31)                                              /*!< PMC_T::DMICRPC: PCBUSY Position        */
#define PMC_DMICRPC_PCBUSY_Msk           (0x1ul << PMC_DMICRPC_PCBUSY_Pos)                 /*!< PMC_T::DMICRPC: PCBUSY Mask            */

#define PMC_KSRPC_KSSRPMS_Pos            (0)                                               /*!< PMC_T::KSRPC: KSSRPMS Position         */
#define PMC_KSRPC_KSSRPMS_Msk            (0x3ul << PMC_KSRPC_KSSRPMS_Pos)                  /*!< PMC_T::KSRPC: KSSRPMS Mask             */

#define PMC_KSRPC_PCBUSY_Pos             (31)                                              /*!< PMC_T::KSRPC: PCBUSY Position          */
#define PMC_KSRPC_PCBUSY_Msk             (0x1ul << PMC_KSRPC_PCBUSY_Pos)                   /*!< PMC_T::KSRPC: PCBUSY Mask              */

/** @} PMC_CONST */
/** @} end of PMC register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __PMC_REG_H__ */
